package model
{
	public class ErrorCode
	{
		public static var ErrorTips:Object = {
			
			0:"操作成功",
			100:"内部错误",
			101:"验证码空",
			102:"验证码超时",
			103:"验证码异常",
			104:"参数错误",
			201:"用户已存在",
			202:"用户不存在",
			203:"未登录",
			204:"登录失败",
			205:"用户未加入公司",
			206:"邀请用户不存在",
			207:"被邀请用户已加入公司",
			208:"邀请已发送",
			301:"上传失败",
			302:"目录已存在",
			303:"文件不存在",
			304:"文件已存在",
			305:"您有异常上传操作，请10分钟后重试",
			401:"您已加入公司",
			402:"公司已存在",
			403:"已发送创建公司请求",
			404:"您尚未加入公司",
			405:"您不是公司创立者",
			501:"参数非法",
			601:"权限错误",
			666:"数据异常",
			667:"数据异常",
			701:"设置默认地址失败"
		}
	}
}